ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/timer_capture/svd/MLDR187_rev2.svd
                <register>
                    <name>F2IRMS2</name>
                    <displayName>F2IRMS2</displayName>
                    <description>F2IRMS2 description</description>
                    <addressOffset>0x00000108</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2STAT</name>
                    <displayName>F2STAT</displayName>
                    <description>F2STAT description</description>
                    <addressOffset>0x0000010C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAROVN</name>
                            <description>F2VAROVN description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVN</name>
                            <description>F2WATTOVN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZEROCRS</name>
                            <description>F2ZEROCRS description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VANLDFL</name>
                            <description>F2VANLDFL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VARNLDFL</name>
                            <description>F2VARNLDFL description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VARSIGN</name>
                            <description>F2VARSIGN description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APNLDFL</name>
                            <description>F2APNLDFL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2APSIGN</name>
                            <description>F2APSIGN description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZXTOF</name>
                            <description>F2ZXTOF description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAOV</name>
                            <description>F2VAOV description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROVP</name>
                            <description>F2VAROVP description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVP</name>
                            <description>F2WATTOVP description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKIF</name>
                            <description>F2PEAKIF description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKVF</name>
                            <description>F2PEAKVF description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2SAGF</name>
                            <description>F2SAGF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_OVR</name>
                            <description>F2IF_OVR description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_FLL</name>
                            <description>F2IF_FLL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2IF_EMP</name>
                            <description>F2IF_EMP description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VF_OVR</name>
                            <description>F2VF_OVR description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_FLL</name>
                            <description>F2VF_FLL description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VF_EMP</name>
                            <description>F2VF_EMP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2MASK</name>
                    <displayName>F2MASK</displayName>
                    <description>F2MASK description</description>
                    <addressOffset>0x00000110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAROVNM</name>
                            <description>F2VAROVNM description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVNM</name>
                            <description>F2WATTOVNM description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZEROCRSM</name>
                            <description>F2ZEROCRSM description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VANLDFLM</name>
                            <description>F2VANLDFLM description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VARNLDFLM</name>
                            <description>F2VARNLDFLM description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VARSIGNM</name>
                            <description>F2VARSIGNM description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APNLDFLM</name>
                            <description>F2APNLDFLM description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APSIGNM</name>
                            <description>F2APSIGNM description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZXTOFM</name>
                            <description>F2ZXTOFM description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAOVM</name>
                            <description>F2VAOVM description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROVPM</name>
                            <description>F2VAROVPM description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVPM</name>
                            <description>F2WATTOVPM description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKIFM</name>
                            <description>F2PEAKIFM description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKVFM</name>
                            <description>F2PEAKVFM description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2SAGFM</name>
                            <description>F2SAGFM description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_OVRM</name>
                            <description>F2IF_OVRM description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_FLLM</name>
                            <description>F2IF_FLLM description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_EMPM</name>
                            <description>F2IF_EMPM description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_OVRM</name>
                            <description>F2VF_OVRM description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_FLLM</name>
                            <description>F2VF_FLLM description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_EMPM</name>
                            <description>F2VF_EMPM description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL1</name>
                    <displayName>CCAL1</displayName>
                    <description>CCAL1 description</description>
                    <addressOffset>0x00000114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I0BGAIN</name>
                            <description>I0BGAIN description. Rev2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V0BGAIN</name>
                            <description>V0BGAIN description. Rev2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL2</name>
                    <displayName>CCAL2</displayName>
                    <description>CCAL2 description</description>
                    <addressOffset>0x00000118</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I1BGAIN</name>
                            <description>I1BGAIN description. Rev2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V1BGAIN</name>
                            <description>V1BGAIN description. Rev2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL3</name>
                    <displayName>CCAL3</displayName>
                    <description>CCAL3 description</description>
                    <addressOffset>0x0000011C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I2BGAIN</name>
                            <description>I2BGAIN description. Rev2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V2BGAIN</name>
                            <description>V2BGAIN description. Rev2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL4</name>
                    <displayName>CCAL4</displayName>
                    <description>CCAL4 description</description>
                    <addressOffset>0x00000120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I3BGAIN</name>
                            <description>I3BGAIN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IRMS_INACTIVE</name>
                    <displayName>F0IRMS_INACTIVE</displayName>
                    <description>F0IRMS_INACTIVE description</description>
                    <addressOffset>0x00000124</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0IRMS_INACTIVE</name>
                            <description>F0IRMS_INACTIVE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTP_L</name>
                    <displayName>F0WATTP_L</displayName>
                    <description>F0WATTP_L description</description>
                    <addressOffset>0x00000128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0WATTHRP_L</name>
                            <description>F0WATTHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTN_L</name>
                    <displayName>F0WATTN_L</displayName>
                    <description>F0WATTN_L description</description>
                    <addressOffset>0x0000012C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0WATTHRN_L</name>
                            <description>F0WATTHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARP_L</name>
                    <displayName>F0VARP_L</displayName>
                    <description>F0VARP_L description</description>
                    <addressOffset>0x00000130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VARHRP_L</name>
                            <description>F0VARHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARN_L</name>
                    <displayName>F0VARN_L</displayName>
                    <description>F0VARN_L description</description>
                    <addressOffset>0x00000134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VARHRN_L</name>
                            <description>F0VARHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VR_L</name>
                    <displayName>F0VR_L</displayName>
                    <description>F0VR_L description</description>
                    <addressOffset>0x00000138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VAHR_L</name>
                            <description>F0VAHR_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1WATTP_L</name>
                    <displayName>F1WATTP_L</displayName>
                    <description>F1WATTP_L description</description>
                    <addressOffset>0x0000013C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WATTHRP_L</name>
                            <description>F1WATTHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
