ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/timer_capture/svd/MLDR187_rev2.svd
                <register>
                    <name>F1WATTN_L</name>
                    <displayName>F1WATTN_L</displayName>
                    <description>F1WATTN_L description</description>
                    <addressOffset>0x00000140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WATTHRN_L</name>
                            <description>F1WATTHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARP_L</name>
                    <displayName>F1VARP_L</displayName>
                    <description>F1VARP_L description</description>
                    <addressOffset>0x00000144</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARHRP_L</name>
                            <description>F1VARHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARN_L</name>
                    <displayName>F1VARN_L</displayName>
                    <description>F1VARN_L description</description>
                    <addressOffset>0x00000148</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARHRN_L</name>
                            <description>F1VARHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VR_L</name>
                    <displayName>F1VR_L</displayName>
                    <description>F1VR_L description</description>
                    <addressOffset>0x0000014C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAHR_L</name>
                            <description>F1VAHR_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTP_L</name>
                    <displayName>F2WATTP_L</displayName>
                    <description>F2WATTP_L description</description>
                    <addressOffset>0x00000150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WATTHRP_L</name>
                            <description>F2WATTHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTN_L</name>
                    <displayName>F2WATTN_L</displayName>
                    <description>F2WATTN_L description</description>
                    <addressOffset>0x00000154</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WATTHRN_L</name>
                            <description>F2WATTHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARP_L</name>
                    <displayName>F2VARP_L</displayName>
                    <description>F2VARP_L description</description>
                    <addressOffset>0x00000158</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARHRP_L</name>
                            <description>F2VARHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARN_L</name>
                    <displayName>F2VARN_L</displayName>
                    <description>F2VARN_L description</description>
                    <addressOffset>0x0000015C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARHRN_L</name>
                            <description>F2VARHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VR_L</name>
                    <displayName>F2VR_L</displayName>
                    <description>F2VR_L description</description>
                    <addressOffset>0x00000160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAHR_L</name>
                            <description>F2VAHR_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <displayName>LOAD</displayName>
                    <description>LOAD description. Rev2</description>
                    <addressOffset>0x00000164</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VANOLOAD</name>
                            <description>VANOLOAD description. Rev2</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>VARNOLOAD</name>
                            <description>VARNOLOAD description. Rev2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>APNOLOAD</name>
                            <description>APNOLOAD description. Rev2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>0</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS_TRUE</name>
                    <displayName>F0VRMS_TRUE</displayName>
                    <description>F0VRMS_TRUE description. Rev2</description>
                    <addressOffset>0x00000168</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VRMS_TRUE</name>
                            <description>F0VRMS_TRUE description. Rev2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS_TRUE</name>
                    <displayName>F1VRMS_TRUE</displayName>
                    <description>F1VRMS_TRUE description. Rev2</description>
                    <addressOffset>0x0000016C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VRMS_TRUE</name>
                            <description>F1VRMS_TRUE description. Rev2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS_TRUE</name>
                    <displayName>F2VRMS_TRUE</displayName>
                    <description>F2VRMS_TRUE description. Rev2</description>
                    <addressOffset>0x00000170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VRMS_TRUE</name>
                            <description>F2VRMS_TRUE description. Rev2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
